{
  "updates": [
    {
      "year": 2026,
      "items": [
        {
          "version": "Beta testing",
          "date": "Jan 26, 2026",
          "description": "Beta testing is starting from 20th Feb onwards!",
          "details": "Our official Beta Testing phase is set to kick off this March, marking a major milestone in the StudiLib journey. We’ve been working around the clock to refine the pixel-art interface and stabilize the real-time synchronization that makes our collaborative spaces so special. This testing period will be crucial for gathering community feedback, squashing remaining bugs, and ensuring the platform can handle the weight of thousands of focused minds studying together. We’ll be rolling out invites in stages to ensure a smooth experience for everyone—stay tuned to our dev logs for the sign-up link!"
        },
        {
          "version": "Website in Chinese and English",
          "date": "Jan 24, 2026",
          "description": "Website in both Chinese and English",
          "details": "The website now is in both English and Chinese. I am currently adjusting the CSS so the website fits on all screens. Now the official updates are on the websites and you can check them out here."
        },
        {
          "version": "Under construction",
          "date": "Jan 22, 2026",
          "description": "Welcome to the first launch of the StudiLib website!",
          "details": "Welcome to the official launching of the StudiLib website. Despite the website is still under construction, you can find most of the infos here and feel free to click around and explore the features of the upcoming update of the software. :)"
        }
      ]
    },
    {
      "year": 2025,
      "items": [
        {
          "version": "Just an idea",
          "date": "Nov 11, 2025",
          "description": "The first concept of StudiLib was born",
          "details": "I have a group of friends that study together quite a lot, even online. We always struggled to keep track of our study sessions, breaks, and goals. I thought, why not create an app that makes this easier and more fun? Thus, the idea for StudiLib was born."
        }
      ]
    }
  ]
}
